<?php
$GLOBALS['GX'] = array(//刑冲合害关系: [0针对天干1针对地支, 关系类型, [发起者...], 形成者, 文字描述]
[0, 0, [0, 6], -1, '甲庚冲'],
[0, 0, [1, 7], -1, '乙辛冲'],
[0, 0, [2, 8], -1, '丙壬冲'],
[0, 0, [3, 9], -1, '丁癸冲'],
[0, 1, [0, 5], 4, '甲己合化土'],
[0, 1, [1, 6], 0, '乙庚合化金'],
[0, 1, [2, 7], 1, '丙辛合化水'],
[0, 1, [3, 8], 2, '丁壬合化木'],
[0, 1, [4, 9], 3, '戊癸合化火'],
[1, 2, [0, 6], -1, '子午冲'],
[1, 2, [1, 7], -1, '丑未冲'],
[1, 2, [2, 8], -1, '寅申冲'],
[1, 2, [3, 9], -1, '卯酉冲'],
[1, 2, [4, 10], -1, '辰戌冲'],
[1, 2, [5, 11], -1, '巳亥冲'],
[1, 3, [2, 5, 8], -1, '寅巳申三刑'],
[1, 3, [1, 10, 7], -1, '丑戌未三刑'],
[1, 4, [2, 5], -1, '寅巳相刑'],
[1, 4, [5, 8], -1, '巳申相刑'],
[1, 4, [1, 10], -1, '丑戌相刑'],
[1, 4, [10, 7], -1, '戌未相刑'],
[1, 4, [0, 3], -1, '子卯相刑'],
[1, 5, [9, 9], -1, '酉酉自刑'],
[1, 5, [11, 11], -1, '亥亥自刑'],
[1, 5, [6, 6], -1, '午午自刑'],
[1, 5, [4, 4], -1, '辰辰自刑'],
[1, 6, [0, 1], 4, '子丑合化土'],
[1, 6, [2, 11], 2, '寅亥合化木'],
[1, 6, [3, 10], 3, '卯戌合化火'],
[1, 6, [4, 9], 0, '辰酉合化金'],
[1, 6, [5, 8], 1, '巳申合化水'],
[1, 6, [6, 7], 3, '午未合化火'],
[1, 7, [2, 6, 10], 3, '寅午戌三合火'],
[1, 7, [8, 0, 4], 1, '申子辰三合水'],
[1, 7, [5, 9, 1], 0, '巳酉丑三合金'],
[1, 7, [11, 3, 7], 2, '亥卯未三合木'],
[1, 8, [8, 0], 1, '申子半合水'],
[1, 8, [0, 4], 1, '子辰半合水'],
[1, 8, [11, 3], 2, '亥卯半合木'],
[1, 8, [3, 7], 2, '卯未半合木'],
[1, 8, [2, 6], 3, '寅午半合火'],
[1, 8, [6, 10], 3, '午戌半合火'],
[1, 8, [5, 9], 0, '巳酉半合金'],
[1, 8, [9, 1], 0, '酉丑半合金'],
[1, 9, [8, 4], 0, '申辰拱合子'],
[1, 9, [11, 7], 3, '亥未拱合卯'],
[1, 9, [2, 10], 6, '寅戌拱合午'],
[1, 9, [5, 1], 9, '巳丑拱合酉'],
[1, 10, [2, 3, 4], 2, '寅卯辰会木'],
[1, 10, [5, 6, 7], 3, '巳午未会火'],
[1, 10, [8, 9, 10], 0, '申酉戌会金'],
[1, 10, [11, 0, 1], 1, '亥子丑会水'],
[1, 11, [2, 4], 3, '寅辰拱会卯'],
[1, 11, [5, 7], 6, '巳未拱会午'],
[1, 11, [8, 10], 9, '申戌拱会酉'],
[1, 11, [11, 1], 0, '亥丑拱会子'],
[1, 12, [3, 8], -1, '卯申暗合'],
[1, 12, [6, 11], -1, '午亥暗合'],
[1, 12, [1, 2], -1, '丑寅暗合'],
[1, 12, [2, 7], -1, '寅未暗合'],
[1, 12, [0, 10], -1, '子戌暗合'],
[1, 12, [0, 4], -1, '子辰暗合'],
[1, 12, [5, 9], -1, '巳酉暗合'],
[1, 13, [0, 7], -1, '子未害'],
[1, 13, [1, 6], -1, '丑午害'],
[1, 13, [2, 5], -1, '寅巳害'],
[1, 13, [3, 4], -1, '卯辰害'],
[1, 13, [8, 11], -1, '申亥害'],
[1, 13, [9, 10], -1, '酉戌害']
);
/**
 * Finding All Element Combinations of an Array https://docstore.mik.ua/orelly/webprog/pcook/ch04_25.htm
 * @param array $array
 * @return array
 */
function pc_array_power_set($array){
    $results = array(array());
    foreach ($array as $element){
        foreach ($results as $combination){
            array_push($results, array_merge(array($element), $combination));
        }
    }
    return $results;
}
/**
 * 从天干地支数组查出所有刑冲合害关系
 * @param array $tg 天干数组
 * @param array $dz 地支数组
 * @return array [[], []]
 */
function GetGX($tg, $dz){
    $list = array([], []); //两个列表:0位是天干关系列表,1位是地支关系列表
	$excludes = array(
		4 => 3, //相刑要把三刑(3)排除
		8 => 7, //半合要把三合(7)排除
		9 => 7, //拱合要把三合(7)排除
		11 => 10, //拱会要把三会(10)排除
	);
	foreach ($GLOBALS['GX'] as $gx){ //[0针对天干1针对地支, 关系类型, [发起者...], 形成者, 文字描述]
		
		$to = ($gx[0] == 0) ? $tg : $dz; //要匹配的类型
		
		$fd = array_intersect($to, $gx[2]); //求交集,返回的键名与$to是一致的
		if(empty(array_diff($gx[2], $fd))){ //说明存在此关系
			
			$c1 = count($fd);
			$c2 = count($gx[2]);
			
			$fds = array(); //最终关联的
			if($c1 < $c2){ //比如亥亥自刑,在只有一个亥的时候也会来这里
				
			}
			if($c1 == $c2){ //有且只有一个此类关系
				array_push($fds, $fd);
			}
			if($c1 > $c2){ //存在多个此类关系,先算出所有可能的组合,再匹配判断以精确指定是哪一个位置
				$set = pc_array_power_set(array_keys($fd));
				foreach ($set as $keys){
					if(count($keys) != $c2){
						continue;
					}
					$fd = array();
					foreach ($keys as $key){
						$fd[$key] = $to[$key];
					}
					if(empty(array_diff($gx[2], $fd))){
						array_push($fds, $fd);
					}
				}
			}
			foreach ($fds as $fd){ //组合成期望的返回
				foreach ($excludes as $expect => $exclude){
					if($gx[1] == $expect){
						foreach ($list[$gx[0]] as $a){ //其实仅针对地支有这种情况
							list($fd2, $gx2) = $a;
							if($gx2[1] == $exclude){
								if(array_intersect($gx[2], $gx2[2])){
									break 3;
								}
							}
						}
						break;
					}
				}
				array_push($list[$gx[0]], [$fd, $gx]);
			}
		}
	}
	return $list;
}